export enum RegularExp {
  moneyExp = '^[0-9]+[\.][0-9]{0,2}$',  // 金额格式,格式定义为带小数的正数，小数点后最多2位
  numletter_ = '^[0-9a-zA-Z\_]+$',  // 英文字母和数字和下划线组成
  numletterchina = '^[0-9a-zA-Z\u4e00-\u9fa5]+$',  // 汉字、字母、数字组成
  emailExp = '^([a-zA-Z0-9_\.\-])+\@(([a-zA-Z0-9\-])+\.)+([a-zA-Z0-9]{2,4})+$', // 邮件地址格式
  telExp = '^((\\(\\d{2,3}\\))|(\\d{3}\\-))?(\\(0\\d{2,3}\\)|0\\d{2,3}-)?[1-9]\\d{6,7}(\\-\\d{1,4})?$',  // 固话格式
  mobileExp = '^(13[0-9]|14[23579]|15[0-9]|16[0134689]|17[2356789]|18[0-9]|19[0-9])\\d{8}$',
  // mobileExp = '^(13[0-9]|14[0-9]|15[0-9]|16[0-9]|17[0-9]|18[0-9]|19[0-9])\\d{8}$',
  // mobileExp = '^[1]\\d{10}$', // 手机号码  中国电信号段 中国联通号段 中国移动号段 虚拟运营商
  decimal = '^[0-9]+([.][0-9]+)?$', // 浮点数
  objExp = '(http://|https://){0,1}[\w\/\.\?\&\=]+', // 网址
  dateExp = '^(\\d{1,4})(-|\\/)(\\d{1,2})\\2(\\d{1,2})$', // 日期 YYYY-MM-DD格式
  intExp = '^[0-9]*[1-9][0-9]*$', // 整数
  int0 = '^\\d+$', // 正整数包含0
  int1 = '^((-\\d+)|(0+))$',  // 负整数包含0
  chinaExp = '^[\u0391-\\uFFE5]+$', // 中文
  bankExp = '^[0-9]{16,19}$', // 银行卡
  usernamesStrAndNum = '^(?![0-9]+$)(?![a-zA-Z]+$)[0-9A-Za-z]{5,13}$', // 以字母开头数字结尾包含数字和字母
  usernameStratStr = '^(?![0-9]+$)(?![a-zA-Z]+$)[0-9A-Za-z]{7,11}$',   // 以字母开头数字结尾包含数字和字母密码
  passwordstartNum = '^(?![0-9]+$)(?![a-zA-Z]+$)[0-9A-Za-z]{8,12}$',   // 以字母开头数字结尾包含数字和字母
  passwordQd1 = '^(?=.*[a-z])(?=.*[A-Z])(?=.*\\d)[^]{11,12}$',  // 8-16个字符包含一个大写 一个小写 一个数字
  passwordQd2 = '^(?=.*[a-z])(?=.*\\d)[^]{9,12}$', // 8-11个字母数字组成
}

export class FormExp {
  msg?: string = '';
  regular?: string;
  isState?: boolean = false;
  stateNum?: boolean = true;
  max?: number;
  min?: number;
}
